[
  {
    "title": "Adelphi Faculty and Students Engaged in Smart-Drug Design Research",
    "category": { "category": "Faculty Research" },
    "date": "October 27, 2021",
    "body": "When Brian Stockman, PhD, became a professor of chemistry at Adelphi University after 18 years in pharmaceutical research and development, his research didn’t miss a beat. In the well-equipped labs on Adelphi’s Garden City campus, Dr. Stockman studies trichomoniasis, the most prevalent nonviral sexually transmitted disease, together with the students he teaches and mentors. Dr. Stockman, chair…"
  },
  {
    "title": "Reflecting on First-Generation Student Week: An Alumna Shares Her Story",
    "category": { "category": "Student Research" },
    "date": "November 3, 2021",
    "body": "When I first went to college, I didn't know what a first-generation student was or that I was one."
  },
  {
    "title": "Adelphi Acquires the Papers of Rep. Lester L. Wolff and Gains a Unique View of the 20th Century",
    "category": { "category": "World Class Academics" },
    "date": "November 3, 2021",
    "body": "Medicare. Civil rights. The Watergate hearings. The Camp David Accords. The Taiwan Relations Act."
  },
  {
    "title": "Greetings From the Office of Community Concerns and Resolution",
    "category": { "category": "Community Engagement" },
    "date": "November 1, 2021",
    "body": "Dear Adelphi Students, Faculty and Staff, I’m pleased to have an opportunity to introduce myself to you. As chief of the new Office of Community Concerns and Resolution at Adelphi, I’m thrilled to be back at my alma mater to serve as a resource of support for our community. I stepped into my new role…"
  },
  {
    "title": "Scheduled Feeding vs. Demand Feeding: Which Is More Beneficial to Preemies?",
    "category": { "category": "Faculty Research" },
    "date": "October 28, 2021",
    "body": "Parents of newborns often struggle with the question, Should I feed my baby on demand or try to get them on a schedule? In hospital nurseries, the traditional approach has long been schedule-based. Every three hours or so, a nurse or parent wakes the baby, changes the diaper and attempts to feed them."
  },
  {
    "title": "A Scholar Examines Unicorn Magic",
    "category": { "category": "Faculty Research" },
    "date": "October 28, 2021",
    "body": "The inspiration for the essay “Magical Aesthetics of Unicorns in Girlhood Visual Culture” by Courtney Weida, EdD, associate professor in the Ruth S. Ammon School of Education, published in the journal Visual Culture & Gender, can be traced back to a room of young girls equipped with sparkling glitter, brightly colored markers, smooth glass stones and…"
  },
  {
    "title": "Adelphi Faculty and Students Engaged in Smart-Drug Design Research",
    "category": { "category": "Faculty Research" },
    "date": "October 27, 2021",
    "body": "When Brian Stockman, PhD, became a professor of chemistry at Adelphi University after 18 years in pharmaceutical research and development, his research didn’t miss a beat. In the well-equipped labs on Adelphi’s Garden City campus, Dr. Stockman studies trichomoniasis, the most prevalent nonviral sexually transmitted disease, together with the students he teaches and mentors. Dr. Stockman, chair…"
  },
  {
    "title": "New Urban Teacher Residency Program Brings Graduate Students to New York City Public Schools",
    "category": { "category": "Student Research" },
    "date": "October 27, 2021",
    "body": "Nothing makes a more positive impact on student learning and success than well-prepared teachers, according to Teacher Residencies: Supporting the Next Generation of Teachers and Students, a 2019 report issued by the office of New York City Comptroller Scott M. Stringer."
  },
  {
    "title": "Ern Knox ‘75 and SharRon McCoy-Knox",
    "category": { "category": "Education and Teaching" },
    "date": "October 27, 2021",
    "body": "Ern Knox ‘75 came to Adelphi first as a commuter student from Roosevelt, and later as a resident student, to study psychology. He found a strong community in the Alpha Phi Alpha fraternity, the first Black fraternity on Long Island, as a member of its second pledge class. SharRon McCoy-Knox, an aspiring nurse, commuted from Freeport. SharRon was actively involved in student life and had a role in establishing the first Black sorority at Adelphi, Alpha Kappa Alpha."
  },
  {
    "title": "In the First-Year Community Action Program, Students Make Meaningful Connections While Making a Difference",
    "category": { "category": "Diversity, Equity & Inclusion" },
    "date": "October 26, 2021",
    "body": "When junior Nicolette Macchio was an incoming first-year student, she received an email about the First-Year Community Action Program (FCAP). “I thought, 'Wow, that's a really cool thing!'\" she said. She joined and loved it so much that she became an FCAP leader."
  },
  {
    "title": "Adelphi's Muslim Student Association: A Safe Space and a Vibrant Community",
    "category": { "category": "Awards and Recognition" },
    "date": "October 26, 2021",
    "body": "Adelphi's Muslim Student Association (MSA) offers a place for Muslim students from all backgrounds and cultures to embrace their faith, participate in activities and connect with one another. "
  },
  {
    "title": "Adelphi Celebrates National Coming Out Day, Launches Transgender Film Series, Talks About “Living Life Openly\"",
    "category": { "category": "Student Life" },
    "date": "October 26, 2021",
    "body": "National Coming Out Day is October 11 and, this year, Adelphi University celebrated it with a series of events over several days. "
  },
  {
    "title": "Active, Involved and Making an Impact: Interview With Senior Melody Smith",
    "category": { "category": "Community Engagement" },
    "date": "October 26, 2021",
    "body": "In addition to being a nursing major, Melody Smith has participated in a wide range of activities and served in leadership positions."
  },
  {
    "title": "Six Cybersecurity Tips to Protect Yourself From Online Attacks",
    "category": { "category": "Diversity, Equity & Inclusion" },
    "date": "October 26, 2021",
    "body": "We’re living more of our lives online than ever. Due in large part to the pandemic, e-commerce was up 32.4 percent in 2020 over the previous year (United States Department of Commerce). And we’re using telehealth services at a rate that’s 38 times higher than before the pandemic (McKinsey & Company)."
  },
  {
    "title": "Grant Will Help More Nurses Become Nurse Educators",
    "category": { "category": "Diversity, Equity & Inclusion" },
    "date": "October 20, 2021",
    "body": "An insufficient number of faculty was the top reason that more than 80,000 qualified applicants to U.S. undergraduate and graduate nursing programs were turned away in 2019, according to an American Association of Colleges of Nursing (AACN) report. This lack of nurse educators, in turn, is leading to a nationwide shortage of nurses that has potentially dire consequences for healthcare—particularly in the midst of an ongoing pandemic."
  },
  {
    "title": "Adelphi Updates Innovative Sensory Room for Neurodivergent Students for In-Person Fall Semester",
    "category": { "category": "Diversity, Equity & Inclusion" },
    "date": "October 20, 2021",
    "body": "In 2018, Adelphi University made history by opening the country's first sensory room at a college or university. The sensory room provides a calming refuge for students and others in the campus community who are on the autism spectrum or have other sensory special needs."
  },
  {
    "title": "The Adelphi NY Statewide Breast Cancer Hotline & Support Program: Answering the Call in October and Year-Round",
    "category": { "category": "Education and Teaching" },
    "date": "October 19, 2021",
    "body": "October is Breast Cancer Awareness Month. It’s an even busier time of events and activities for volunteers at the Adelphi NY Statewide Breast Cancer Hotline & Support Program, which offers counseling and workshops for individuals, friends and families battling breast cancer, 24 hours a day, seven days a week, year-round. And for everyone at Adelphi…"
  },
  {
    "title": "Adelphi Public Safety Pink Patch Breast Cancer Fundraiser Featured by News 12",
    "category": { "category": "Technology" },
    "date": "October 14, 2021",
    "body": "For the second year, the Pink Patch Project is back at Adelphi University, raising awareness and funds for those affected by breast cancer."
  },
  {
    "title": "Celebrating the 2021 Class of 10 Under 10 Inductees—and the 10th Anniversary of Our 10 Under 10 Young Alumni Recognition Program",
    "category": { "category": "Student Life" },
    "date": "October 13, 2021",
    "body": "In 2012, Adelphi University launched the 10 Under 10 Young Alumni Recognition Program to honor alumni who have achieved exceptional career and professional accomplishments, even before celebrating their 10-year Adelphi reunion. "
  },
  {
    "title": "Social Work Professor Elizabeth Palley, JD, PhD, Awarded Grant to Research Home-Based Child Care Providers",
    "category": { "category": "Health and Wellness" },
    "date": "October 13, 2021",
    "body": "Elizabeth Palley, JD, PhD, a professor in the School of Social Work, was awarded an $80,000 grant from the Washington Center for Equitable Growth to research informal, home-based child care providers—often those who care for children from low-income families—and identify challenges providers face in delivering high-quality, affordable care."
  },
  {
    "title": "Sarafina Bush ’12 Uses Costume Design to Share Powerful Stories",
    "category": { "category": "Breast Cancer Awareness" },
    "date": "October 12, 2021",
    "body": "Growing up, Sarafina Bush ’12 always loved dance and theater. It seems preordained, as the daughter of Adelphi sociology professor Melanie Bush, PhD, she was named after the title character in the musical Sarafina!, which depicts the story of a group of South African students brave enough to participate in the Soweto riots against apartheid."
  },
  {
    "title": "Panther Potential Program Gives Nontraditional Students a Pathway Back to Class",
    "category": { "category": "Health and Wellness" },
    "date": "October 7, 2021",
    "body": "Nola Jackson, 59, of Brentwood, New York, was 30 credits away from earning her 120-credit BA in Social Science in Adelphi's College of Professional and Continuing Studies (CPCS) in 2014 when she became ill and was unable to work or attend classes. "
  },
  {
    "title": "Adelphi University's Certificate in English to Spanish Translation Studies Opens a World of Career Opportunities",
    "category": { "category": "Public Safety" },
    "date": "October 7, 2021",
    "body": "The U.S. Department of Labor indicates that the demand for translators and interpreters will grow at least 18 percent through 2026."
  },
  {
    "title": "Adelphi Nominated in Nine Best of Long Island Categories, Including Best University —Also for Two Long Island Choice Awards",
    "category": { "category": "Breast Cancer Awareness" },
    "date": "October 7, 2021",
    "body": "Adelphi has been nominated in nine categories in the annual Bethpage Best of Long Island competition organized by Schneps Media. Online voting continues through December 15 and winners will be announced early in 2022. Individuals may vote once a day."
  },
  {
    "title": "Experienced Educational Leader Named Adelphi's New Vice President of University Advancement and External Relations",
    "category": { "category": "Community Engagement" },
    "date": "October 7, 2021",
    "body": "Thomas Kline, EdD, will join Adelphi University's Executive Leadership team as vice president of University advancement and external relations beginning November 1. Dr. Kline is currently vice president for institutional advancement at Carthage College in Kenosha, Wisconsin, where he has served in several roles since 2013."
  },
  {
    "title": "The Equitable Adelphi Action Team Continues to Combat Oppression",
    "category": { "category": "Public Safety" },
    "date": "October 6, 2021",
    "body": "The Equitable Adelphi Action Team was formed in the summer of 2020 to help create and sustain an inclusive campus community. Formed by the Division of Student Affairs, the team consists of faculty members, administrators and students. Now is a great time for students to join and use their voices to bring forth change on campus."
  },
  {
    "title": "Spirit Weekend Is Back in Person to Celebrate Adelphi's 125th Anniversary",
    "category": { "category": "In the News" },
    "date": "October 6, 2021",
    "body": "Spirit Weekend is one of Adelphi's newest and already most beloved traditions. From Casino Night to Prestigious Panthers, it's a weekend where students, alumni, faculty, staff and community members can come together to show Panther pride and connect with one another. "
  },
  {
    "title": "Dr. Marilyn B. Klainberg ‘63, MS ‘77, EdD, Professor",
    "category": { "category": "Alumni Making a Difference" },
    "date": "October 6, 2021",
    "body": "My relationship with Adelphi is a two way street - as much as I have provided for the University, it has done the same for me."
  },
  {
    "title": "New Faculty Represent \"Exceptional Cultural and Intellectual Diversity\"",
    "category": { "category": "Education and Teaching" },
    "date": "October 5, 2021",
    "body": "This fall, we are joined by 22 new faculty members spanning all our schools and colleges and our University Libraries. Our mission to transform lives is enriched by their unique expertise and contributions."
  },
  {
    "title": "Adelphi’s First-Year Class Is Largest and Most Diverse Group in Our History",
    "category": { "category": "Distinguished Faculty" },
    "date": "October 5, 2021",
    "body": "This fall, Adelphi welcomes a landmark first-year class. A record 1,330 new students joined our Panther family, from 34 states and 23 countries. More than 300 transfers and 820 graduate students are continuing their academic journey with us this fall in our eight world-class colleges and schools. And we are joined on campus this year by 30 of our first community college students through our innovative Nassau-Adelphi Gateway program."
  },
  {
    "title": "A Banner Year for Faculty Grants",
    "category": { "category": "World Class Academics" },
    "date": "October 4, 2021",
    "body": "As Adelphi moved to remote learning in the spring of 2020, one of our top priorities was to ensure that all students had the reliable broadband access and computer hardware they needed."
  }
]
