[{"title": "Experienced Educational Leader Named Adelphi's New Vice President of University Advancement and External Relations", "category": {"category": "Community Engagement"}, "date": "October 7, 2021", "body": "Thomas Kline, EdD, will join Adelphi University's Executive Leadership team as vice president of University advancement and external relations beginning November 1. Dr. Kline is currently vice president for institutional advancement at Carthage College in Kenosha, Wisconsin, where he has served in several roles since 2013."}, {"title": "Grant Will Help More Nurses Become Nurse Educators", "category": {"category": "President"}, "date": "October 20, 2021", "body": "An insufficient number of faculty was the top reason that more than 80,000 qualified applicants to U.S. undergraduate and graduate nursing programs were turned away in 2019, according to an American Association of Colleges of Nursing (AACN) report. This lack of nurse educators, in turn, is leading to a nationwide shortage of nurses that has potentially dire consequences for healthcare—particularly in the midst of an ongoing pandemic."}, {"title": "Adelphi Updates Innovative Sensory Room for Neurodivergent Students for In-Person Fall Semester", "category": {"category": "Student Life"}, "date": "October 20, 2021", "body": "In 2018, Adelphi University made history by opening the country's first sensory room at a college or university. The sensory room provides a calming refuge for students and others in the campus community who are on the autism spectrum or have other sensory special needs."}, {"title": "The Adelphi NY Statewide Breast Cancer Hotline & Support Program: Answering the Call in October and Year-Round", "category": {"category": "Health and Wellness"}, "date": "October 19, 2021", "body": "October is Breast Cancer Awareness Month. It’s an even busier time of events and activities for volunteers at the Adelphi NY Statewide Breast Cancer Hotline & Support Program, which offers counseling and workshops for individuals, friends and families battling breast cancer, 24 hours a day, seven days a week, year-round. And for everyone at Adelphi…"}, {"title": "Adelphi Public Safety Pink Patch Breast Cancer Fundraiser Featured by News 12", "category": {"category": "Breast Cancer Awareness"}, "date": "October 14, 2021", "body": "For the second year, the Pink Patch Project is back at Adelphi University, raising awareness and funds for those affected by breast cancer."}, {"title": "Celebrating the 2021 Class of 10 Under 10 Inductees—and the 10th Anniversary of Our 10 Under 10 Young Alumni Recognition Program", "category": {"category": "Health and Wellness"}, "date": "October 13, 2021", "body": "In 2012, Adelphi University launched the 10 Under 10 Young Alumni Recognition Program to honor alumni who have achieved exceptional career and professional accomplishments, even before celebrating their 10-year Adelphi reunion. "}, {"title": "Social Work Professor Elizabeth Palley, JD, PhD, Awarded Grant to Research Home-Based Child Care Providers", "category": {"category": "Public Safety"}, "date": "October 13, 2021", "body": "Elizabeth Palley, JD, PhD, a professor in the School of Social Work, was awarded an $80,000 grant from the Washington Center for Equitable Growth to research informal, home-based child care providers—often those who care for children from low-income families—and identify challenges providers face in delivering high-quality, affordable care."}, {"title": "Sarafina Bush ’12 Uses Costume Design to Share Powerful Stories", "category": {"category": "Breast Cancer Awareness"}, "date": "October 12, 2021", "body": "Growing up, Sarafina Bush ’12 always loved dance and theater. It seems preordained, as the daughter of Adelphi sociology professor Melanie Bush, PhD, she was named after the title character in the musical Sarafina!, which depicts the story of a group of South African students brave enough to participate in the Soweto riots against apartheid."}, {"title": "Panther Potential Program Gives Nontraditional Students a Pathway Back to Class", "category": {"category": "Community Engagement"}, "date": "October 7, 2021", "body": "Nola Jackson, 59, of Brentwood, New York, was 30 credits away from earning her 120-credit BA in Social Science in Adelphi's College of Professional and Continuing Studies (CPCS) in 2014 when she became ill and was unable to work or attend classes. "}, {"title": "Adelphi University's Certificate in English to Spanish Translation Studies Opens a World of Career Opportunities", "category": {"category": "Public Safety"}, "date": "October 7, 2021", "body": "The U.S. Department of Labor indicates that the demand for translators and interpreters will grow at least 18 percent through 2026."}, {"title": "Adelphi Nominated in Nine Best of Long Island Categories, Including Best University —Also for Two Long Island Choice Awards", "category": {"category": "In the News"}, "date": "October 7, 2021", "body": "Adelphi has been nominated in nine categories in the annual Bethpage Best of Long Island competition organized by Schneps Media. Online voting continues through December 15 and winners will be announced early in 2022. Individuals may vote once a day."}, {"title": "Experienced Educational Leader Named Adelphi's New Vice President of University Advancement and External Relations", "category": {"category": "Alumni Making a Difference"}, "date": "October 7, 2021", "body": "Thomas Kline, EdD, will join Adelphi University's Executive Leadership team as vice president of University advancement and external relations beginning November 1. Dr. Kline is currently vice president for institutional advancement at Carthage College in Kenosha, Wisconsin, where he has served in several roles since 2013."}, {"title": "The Equitable Adelphi Action Team Continues to Combat Oppression", "category": {"category": "Education and Teaching"}, "date": "October 6, 2021", "body": "The Equitable Adelphi Action Team was formed in the summer of 2020 to help create and sustain an inclusive campus community. Formed by the Division of Student Affairs, the team consists of faculty members, administrators and students. Now is a great time for students to join and use their voices to bring forth change on campus."}, {"title": "Spirit Weekend Is Back in Person to Celebrate Adelphi's 125th Anniversary", "category": {"category": "Distinguished Faculty"}, "date": "October 6, 2021", "body": "Spirit Weekend is one of Adelphi's newest and already most beloved traditions. From Casino Night to Prestigious Panthers, it's a weekend where students, alumni, faculty, staff and community members can come together to show Panther pride and connect with one another. "}, {"title": "Dr. Marilyn B. Klainberg ‘63, MS ‘77, EdD, Professor", "category": {"category": "World Class Academics"}, "date": "October 6, 2021", "body": "My relationship with Adelphi is a two way street - as much as I have provided for the University, it has done the same for me."}, {"title": "New Faculty Represent \"Exceptional Cultural and Intellectual Diversity\"", "category": {"category": "Faculty Research"}, "date": "October 5, 2021", "body": "This fall, we are joined by 22 new faculty members spanning all our schools and colleges and our University Libraries. Our mission to transform lives is enriched by their unique expertise and contributions."}, {"title": "Adelphi’s First-Year Class Is Largest and Most Diverse Group in Our History", "category": {"category": "Awards and Recognition"}, "date": "October 5, 2021", "body": "This fall, Adelphi welcomes a landmark first-year class. A record 1,330 new students joined our Panther family, from 34 states and 23 countries. More than 300 transfers and 820 graduate students are continuing their academic journey with us this fall in our eight world-class colleges and schools. And we are joined on campus this year by 30 of our first community college students through our innovative Nassau-Adelphi Gateway program."}, {"title": "A Banner Year for Faculty Grants", "category": {"category": "Entertainment and Performance"}, "date": "October 4, 2021", "body": "As Adelphi moved to remote learning in the spring of 2020, one of our top priorities was to ensure that all students had the reliable broadband access and computer hardware they needed."}, {"title": "Raising the Banner of Diversity", "category": {"category": "Student Success Stories"}, "date": "October 4, 2021", "body": "Leading our \"Many Voices. One Adelphi.\" message is the renowned poet and our Vice President of Diversity, Equity and Inclusion Jacqueline Jones LaMon, JD. Her welcome-back-to-campus campaign features banners across our main campus highlighting the diversity of our student-led organizations. They promote our vibrant and engaged community and the voices and experiences of all our students."}, {"title": "An Adelphi Expert Considers the Future of Afghanistan Under the Taliban", "category": {"category": "Diversity, Equity & Inclusion"}, "date": "October 4, 2021", "body": null}, {"title": "Preparing for Flu Season 2021-2022", "category": {"category": "Alumni Making a Difference"}, "date": "September 30, 2021", "body": "Adelphi University Health Services strongly encourages our Adelphi community to take measures that safeguard their family, friends, and colleagues during flu season."}, {"title": "Adelphi Psychology Faculty Member Will Release Children's Book on Dealing With Anger", "category": {"category": "World Class Academics"}, "date": "September 30, 2021", "body": "Deborah Serani, PsyD, a senior adjunct faculty member at Adelphi University, psychologist and award-winning author, will release her next children's picture book, Sometimes When I'm Mad, in mid-October. "}, {"title": "Fall Arts Festival Focuses on Rebuilding Human Connections in the Wake of the Pandemic", "category": {"category": "World Class Academics"}, "date": "September 29, 2021", "body": "Responses to the political tensions of the past year and the ongoing coronavirus pandemic will take center stage at Adelphi University's Fall Arts Festival."}, {"title": "Q&A With Carolyn Springer, PhD, New Director of the Center for African, Black and Caribbean Studies", "category": {"category": "Entertainment and Performance"}, "date": "September 29, 2021", "body": "For more than 50 years, the Center for African, Black and Caribbean Studies (CABCS) has been a safe space for students and faculty of color."}, {"title": "Release of the 2021 Annual Security & Fire Safety Report", "category": {"category": "World Class Academics"}, "date": "September 28, 2021", "body": "Dear Adelphi Community Members, The Clery Act is a federal law which mandates the reporting of timely, accurate, and complete information about crime and safety both on and off campus to members of the university community. This enables students, faculty, staff, alumni, and visitors to make informed decisions to keep themselves safe and to educate…"}, {"title": "Adelphi Continues Art, Social Activism Project With Fall Events", "category": {"category": "Community Engagement"}, "date": "September 27, 2021", "body": "Earlier this year, Adelphi co-debuted an interdisciplinary series that combined art and social action to engage people in transforming society. This fall, the series, Artivism: The Power of Art for Social Transformation, restarts with several virtual and in-person events that showcase how the arts can redress inequities, reflect all voices and push society forward. The…"}, {"title": "An Unequal Burden", "category": {"category": "COVID-19"}, "date": "September 23, 2021", "body": "Illuminating COVID's toll on African American mothers and children."}, {"title": "Adelphi Receives INSIGHT Into Diversity HEED Award for Commitment to Diversity", "category": {"category": "Community Engagement"}, "date": "September 22, 2021", "body": "In recognition of Adelphi's dedication to diversity, equity and inclusion, the University has earned the 2021 INSIGHT Into Diversity Higher Education Excellence in Diversity (HEED) Award for the fourth year in a row."}, {"title": "Adelphi Again Highly Ranked by U.S. News, WSJ/THE, Princeton Review, College Factual", "category": {"category": "President"}, "date": "September 21, 2021", "body": "Recent national rankings show that Adelphi University continues to hold top spots in several categories, with U.S. News & World Report, Princeton Review, The Wall Street Journal, and College Factual including Adelphi in their annual guides, with special emphasis on nursing, business, social mobility and best value."}, {"title": "World-Renowned Psychologist Paul Ekman, PhD '58, '08 (Hon.), to Deliver Adelphi's Annual Lindemann Lecture in Human Development", "category": {"category": "Student Life"}, "date": "September 21, 2021", "body": "World's deception expert is ranked 15th among the most influential psychologists of this century"}, {"title": "Panther Potential Program Offers a Route to a Bachelor's Degree for Nontraditional Students: Q&A With Andy Atzert, Dean, College of Professional and Continuing Studies", "category": {"category": "Diversity, Equity & Inclusion"}, "date": "September 21, 2021", "body": "The path to earning a bachelor's degree doesn't always run smoothly. Sometimes students are sidelined by personal responsibilities, or they have a change of heart or a career opportunity."}]